zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_efuse.h
/*******************************************************************************
* Function Name: Cy_EFUSE_Init
****************************************************************************//**
*
* This function enables the EFUSE block and initializes the registers with the
* default values.
*
* \param base
* The pointer to the EFUSE instance.
*
* \return
* The EFUSE API status \ref cy_en_efuse_status_t.
*
* \note
* Supported in CAT1B devices.
*
*******************************************************************************/
cy_en_efuse_status_t Cy_EFUSE_Init(EFUSE_Type *base);


/*******************************************************************************
* Function Name: Cy_EFUSE_Enable
****************************************************************************//**
*
* Enables the EFUSE block.
*
* \param base
* The pointer to the EFUSE instance.
*
* \note
* Supported in CAT1B devices.
*
*******************************************************************************/
void Cy_EFUSE_Enable(EFUSE_Type *base);


/*******************************************************************************
* Function Name: Cy_EFUSE_Disable
****************************************************************************//**
*
* Disables the EFUSE block. All non-retention registers (command and status
* registers) are reset to their default values when the IP is disabled.
*
* \param base
* The pointer to the EFUSE instance.
*
* \note
* Supported in CAT1B devices.
*
*******************************************************************************/
void Cy_EFUSE_Disable(EFUSE_Type *base);

/*******************************************************************************
* Function Name: Cy_EFUSE_IsEnabled
****************************************************************************//**
*
* Check if EFUSE block is Enabled or Not.
*
* \param base
* The pointer to the EFUSE instance.
*
* \return
* - True if the EFUSE is enabled.
* - False if EFUSE is disabled.
*
* \note
* Supported in CAT1B devices.
*
*******************************************************************************/
bool Cy_EFUSE_IsEnabled(EFUSE_Type *base);


/*******************************************************************************
* Function Name: Cy_EFUSE_DeInit
****************************************************************************//**
*
* Disables the EFUSE block. All non-retention registers (command and status
* registers) are reset to their default values when the IP is disabled.
*
* \param base
* The pointer to the EFUSE instance.
*
* \note
* Supported in CAT1B devices.
*
*******************************************************************************/
void Cy_EFUSE_DeInit(EFUSE_Type *base);


/*******************************************************************************
* Function Name: Cy_EFUSE_WriteBit
****************************************************************************//**
*
* Writes a bit to EFUSE by blowing a fuse, so this function is able to write 1s
* only. Before write operations you must call \ref Cy_EFUSE_Init().
* It is recommended to disable the block when not using it. Call
* \ref Cy_EFUSE_Disable() to disable the EFUSE block.
*
* \param base
* The pointer to the EFUSE instance.
*
* \param bitPos
* Bit position within byte.
*
* \param offset
* Byte position within EFUSE address space.
*
* \return
* The EFUSE API status \ref cy_en_efuse_status_t.
*
* \note
* - The caller is expected to verify the input parameters for correctness
*  and to check whether the bit is already blown before calling this function
*  to not over-program bits.
* - Supported in CAT1B devices.
*
*******************************************************************************/
cy_en_efuse_status_t Cy_EFUSE_WriteBit(EFUSE_Type *base, uint32_t bitPos, uint32_t offset);


/*******************************************************************************
* Function Name: Cy_EFUSE_WriteByte
****************************************************************************//**
*
* Writes one byte.
* Before write operations you must call \ref Cy_EFUSE_Init().
* It is recommended to disable the block when not using it. Call
* \ref Cy_EFUSE_Disable() to disable the EFUSE block.
*
* \param base
* The pointer to the EFUSE instance.
*
* \param src
* Value to be written.
*
* \param offset
* Byte offset from the EFUSE base address
*
* \return
* The EFUSE API status \ref cy_en_efuse_status_t.
*
* \note
* - The caller is expected to check whether the bits within the byte
*  are already blown before calling this function to not over-program bits.
* - Supported in CAT1B devices.
*******************************************************************************/
cy_en_efuse_status_t Cy_EFUSE_WriteByte(EFUSE_Type *base, uint32_t src, uint32_t offset);


/*******************************************************************************
* Function Name: Cy_EFUSE_WriteWord
****************************************************************************//**
*
* Writes every bit set in src that was not already programmed.
* Before write operations you must call \ref Cy_EFUSE_Init().
* It is recommended to disable the block when not using it. Call
* \ref Cy_EFUSE_Disable() to disable the EFUSE block.
*
* \param base
* The pointer to the EFUSE instance.
*
* \param src
* Value to be written.
*
* \param offset
* Offset from the EFUSE base address. Must be 4-byte aligned.
*
* \return 
* The EFUSE API status \ref cy_en_efuse_status_t.
*
* \note
* - The caller is expected to check whether the bits within the 32-bit word
*  are already blown before calling this function to not over-program bits.
* - Supported in CAT1B devices.
*
*******************************************************************************/
cy_en_efuse_status_t Cy_EFUSE_WriteWord(EFUSE_Type *base, uint32_t src, uint32_t offset);


/*******************************************************************************
* Function Name: Cy_EFUSE_WriteWordArray
****************************************************************************//**
*
* Writes the values of num 32-bit words from the location pointed to by src to
* the EFUSE location pointed to by offset.
*
* Before write operations you must call \ref Cy_EFUSE_Init().
* It is recommended to disable the block when not using it. Call
* \ref Cy_EFUSE_Disable() to disable the EFUSE block.
*
* \param base
* The pointer to the EFUSE instance.
*
* \param src
* Pointer to the source of data to be written.
*
* \param offset
* Offset from the EFUSE base address. Must be 4-byte aligned.
*
* \param num
* Number of 32-bit words to be written.
*
* \return 
* The EFUSE API status \ref cy_en_efuse_status_t.
*
* \note
* - The caller is expected to check whether the bits within the 32-bit words
*  are already blown before calling this function to not over-program bits.
* - Supported in CAT1B devices.
*
*******************************************************************************/
cy_en_efuse_status_t Cy_EFUSE_WriteWordArray(EFUSE_Type *base, const uint32_t *src, uint32_t offset, uint32_t num);

