zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_efuse.h
/*******************************************************************************
* Function Name: Cy_EFUSE_ReadBit
****************************************************************************//**
*
* Reads a bit from EFUSE.
* Before read operations you must call \ref Cy_EFUSE_Init().
* It is recommended to disable the block when not using it.
* Call \ref Cy_EFUSE_Disable() to disable the EFUSE block.
*
* \param base
* The pointer to the EFUSE instance.
*
* \param dst
* Pointer to the destination where the read bit is stored.
*
* \param bitPos
* Bit position within byte.
*
* \param offset
* Byte offset from the EFUSE base address.
*
* \return
* The EFUSE API status \ref cy_en_efuse_status_t.
*
* \note
* Supported in CAT1B devices.
*
*******************************************************************************/
cy_en_efuse_status_t Cy_EFUSE_ReadBit(EFUSE_Type *base, uint8_t *dst, uint32_t bitPos, uint32_t offset);

/*******************************************************************************
* Function Name: Cy_EFUSE_ReadByte
****************************************************************************//**
*
* Reads byte from EFUSE.
* Before read operations you must call \ref Cy_EFUSE_Init().
* It is recommended to disable the block when not using it. Call
* \ref Cy_EFUSE_Disable() to disable the EFUSE block.
*
* \param base
* The pointer to the EFUSE instance.
*
* \param dst
* Pointer to the destination where the read byte is stored.
*
* \param offset
* Byte offset from the EFUSE base address.
*
* \return 
* The EFUSE API status \ref cy_en_efuse_status_t.
*
* \note
* Supported in CAT1B devices.
*
*******************************************************************************/
cy_en_efuse_status_t Cy_EFUSE_ReadByte(EFUSE_Type *base, uint8_t *dst, uint32_t offset);


/*******************************************************************************
* Function Name: Cy_EFUSE_ReadWord
****************************************************************************//**
*
* Reads a 32-bit word from EFUSE.
* Before read operations you must call \ref Cy_EFUSE_Init().
* It is recommended to disable the block when not using it. Call
* \ref Cy_EFUSE_Disable() to disable the EFUSE block.
*
* \param base
* The pointer to the EFUSE instance.
*
* \param dst
* Pointer to the destination where the read word is stored.
*
* \param offset
* Offset from the EFUSE base address. Must be 4-byte aligned.
*
* \return 
* The EFUSE API status \ref cy_en_efuse_status_t.
*
* \note
* Supported in CAT1B devices.
*
*******************************************************************************/
cy_en_efuse_status_t Cy_EFUSE_ReadWord(EFUSE_Type *base, uint32_t *dst, uint32_t offset);


/*******************************************************************************
* Function Name: Cy_EFUSE_ReadWordArray
****************************************************************************//**
*
* Reads an array of 32-bit words from EFUSE.
* Before read operations you must call \ref Cy_EFUSE_Init().
* It is recommended to disable the block when not using it. Call
* \ref Cy_EFUSE_Disable() to disable the EFUSE block.
*
* \param base
* The pointer to the EFUSE instance.
*
* \param dst
* Pointer to the destination array where the content is to be read.
*
* \param offset
* Start address of the data to read in EFUSE.
*
* \param num
* Number of words to read.
*
* \return 
* The EFUSE API status \ref cy_en_efuse_status_t.
*
* \note
* Supported in CAT1B devices.
*
*******************************************************************************/
cy_en_efuse_status_t Cy_EFUSE_ReadWordArray(EFUSE_Type *base, uint32_t *dst, uint32_t offset, uint32_t num);


/*******************************************************************************
* Function Name: Cy_EFUSE_WriteBootRow
****************************************************************************//**
*
* Writes data into BOOTROW.
* Before write operations you must call \ref Cy_EFUSE_Init().
* It is recommended to disable the block when not using it. Call
* \ref Cy_EFUSE_Disable() to disable the EFUSE block.
*
* \param base
* The pointer to the EFUSE instance.
*
* \param bootrow
* 32-bit value to be written into bootrow.
*
* \return 
* The EFUSE API status \ref cy_en_efuse_status_t.
*
* \note
* Supported in CAT1B devices.
*
*******************************************************************************/
cy_en_efuse_status_t Cy_EFUSE_WriteBootRow(EFUSE_Type *base, uint32_t bootrow);


/*******************************************************************************
* Function Name: Cy_EFUSE_ReadBootRow
****************************************************************************//**
*
* Reads data from BOOTROW.
* The BOOTROW information is latched upon system reset and is readable as
* MMIO register.
*
* \param base
* The pointer to the EFUSE instance.
*
* \param bootrow
* Pointer to the variable where the content of BOOTROW is read to.
*
* \return 
* The EFUSE API status \ref cy_en_efuse_status_t.
*
* \note
* Supported in CAT1B devices.
*
*******************************************************************************/
cy_en_efuse_status_t Cy_EFUSE_ReadBootRow(EFUSE_Type *base, uint32_t *bootrow);
#endif

/** \} group_efuse_functions */

#if defined(__cplusplus)
}
#endif

#endif /* #ifdef CY_IP_MXEFUSE */

#endif /* #if !defined(CY_EFUSE_H) */

/** \} group_efuse */


/* [] END OF FILE */
